{
    "company": [
        {
            "id": 1,
            "name": "Hanoman Outlet",
            "type": "Commercial",
            "title": "Reservation & Schedule Management",
            "description": "Hanoman Outlet is a booking system owned by Dimata IT Solution. It shows information of all available room and person-in-charge at specific time for service products. This information is used to create schedule for treatment. It also provides the ability to manage the reservation process from the start to the end of the treatment. It is currently designed for spa business.",
            "role": [
                "Design the system to be able to manage treatment schedule.",
                "Make sure the system provides valid information for available treatment."
            ],
            "tool": [
                "Java",
                "JSP",
                "Servlet",
                "jQuery",
                "AJAX",
                "Bootstrap",
                "MySQL"
            ]
        },
        {
            "id": 2,
            "name": "ProChain",
            "type": "Commercial",
            "title": "Retail System & Distribution",
            "description": "ProChain is a retail system owned by Dimata IT Solution. Made for handling stock counting and distribution. Provides records of item distribution flow from receive documents to sales report. Designed for many kind of retail business such as shop, restaurant, warehouse, etc.",
            "role": [
                "Put additional features based on client's requirements.",
                "Bug fixing and problem solving.",
                "Maintain the system to provides valid data for reporting."
            ],
            "tool": [
                "Java",
                "JSP",
                "Servlet",
                "jQuery",
                "AJAX",
                "Bootstrap",
                "MySQL"
            ]
        },
        {
            "id": 3,
            "name": "D-Cashier",
            "type": "Commercial",
            "title": "Billing & Payment System",
            "description": "D-Cashier is a system for making payments for retail businesses owned by Dimata IT Solution. This system work together with ProChain for handling the selling process of all the item. It provides information about all item and their price and count the tax and service if available. Not only for making payments, it also can make bill for return item or even split the bills for many kind of reason.",
            "role": [
                "Put additional features based on client's requirements.",
                "Bug fixing and problem solving.",
                "Make sure the system can handle the counting process correctly so it can provide the valid data to create a balance journals for the accountants."
            ],
            "tool": [
                "Java",
                "JSP",
                "Servlet",
                "jQuery",
                "AJAX",
                "Bootstrap",
                "MySQL"
            ]
        },
        {
            "id": 4,
            "name": "Sedana",
            "type": "Commercial",
            "title": "Savings & Loan Management System",
            "description": "Sedana is a savings and loans information system owned by Dimata IT Solution. This application helps micro-credit businesses to record loans and also savings for their customers. This application is made based on standard rules for the savings and loans business.",
            "role": [
                "Designed the system to handle various kind of savings and loans requirements based on client's request.",
                "Create feature to records all activities that happened in the system.",
                "Make sure the system gives the precise calculation result for the interest value since it manages money."
            ],
            "tool": [
                "Java",
                "JSP",
                "Servlet",
                "jQuery",
                "AJAX",
                "Bootstrap",
                "MySQL"
            ]
        }
    ],
    "personal": []
}