{
    "company": [
        {
            "id": 1,
            "name": "Hanoman Outlet",
            "type": "Commercial",
            "title": "Reservation & Schedule Management",
            "description": "Hanoman Outlet is a booking system owned by Dimata IT Solution. Designed to show information about product availability by checking the availability of the room and person-in-charge at specific date and time. This information will be used to create schedule for service products. It also provides the ability to manage the reservation process and show the status of an on-going service. This system is currently designed for spa business.",
            "role": [
                "Develop the system together with the team to provides valid information of available products.",
                "Develop reservation feature including generate the schedule, choosing the room and counting the price automatically based on service time duration.",
                "Develop feature for user to modify the schedule such as changing the room, person-in-charge or time duration for many kind of reason."
            ],
            "tool": [
                "Java",
                "JSP",
                "Servlet",
                "jQuery",
                "AJAX",
                "Bootstrap",
                "MySQL"
            ]
        },
        {
            "id": 2,
            "name": "ProChain",
            "type": "Commercial",
            "title": "Retail System & Distribution",
            "description": "ProChain is a retail system owned by Dimata IT Solution. Designed for handling stock counting and distribution. Provides records of item distribution flow from receive process to sales report. This information help user to see status of every item they have in term of stock quantity so the user can decide wether to do some purchase or just to see current status of all sold items. Designed for many kind of retail business such as shop, restaurant, warehouse, etc.",
            "role": [
                "Develop additional features based on client's requirements.",
                "Bug fixing and problem solving.",
                "Make sure the system provides valid stock data for reporting."
            ],
            "tool": [
                "Java",
                "JSP",
                "Servlet",
                "jQuery",
                "AJAX",
                "Bootstrap",
                "MySQL"
            ]
        },
        {
            "id": 3,
            "name": "D-Cashier",
            "type": "Commercial",
            "title": "Billing & Payment System",
            "description": "D-Cashier is a cashier system for making bills and payments for retail businesses owned by Dimata IT Solution. This system work together with ProChain for handling the selling process of the item. It provides information about item price and count the discount, tax and service if available. Not only for making bills and payments of good sold, it also can make bill for return item or even split the bills for many kind of reason.",
            "role": [
                "Develop additional features based on client's requirements.",
                "Bug fixing and problem solving.",
                "Make sure the system count price correctly to generate balance journals for the accountants."
            ],
            "tool": [
                "Java",
                "JSP",
                "Servlet",
                "jQuery",
                "AJAX",
                "Bootstrap",
                "MySQL"
            ]
        },
        {
            "id": 4,
            "name": "Sedana",
            "type": "Commercial",
            "title": "Savings & Loans Management System",
            "description": "Sedana is a savings and loans information system owned by Dimata IT Solution. Designed to helps micro-credit business to record savings and loans transactions for their customers and provides the information they need for further action. Not only for record data, it also has features that help users to simplify the process by automatically generate data they need such as payment schedule and the interest. This application is made by following the common standard rules for savings and loans business, but still can be customize based on client's need.",
            "role": [
                "Develop the system together with the team to handle various kind of savings and loans requirements based on client's request.",
                "Make sure the system gives the precise calculation result for the interest value to prevent money lost.",
                "Make sure the system provide all the information that needed about all activity that happened in the system so the user can compare it with the reports."
            ],
            "tool": [
                "Java",
                "JSP",
                "Servlet",
                "jQuery",
                "AJAX",
                "Bootstrap",
                "MySQL"
            ]
        }
    ],
    "personal": []
}